{
  "proposal": [
    {
      "title": "OData v4: the easy way of exposing and querying structured data",
      "description": "The REST architectural style is the currently most appreciated way to structure a backend for several good reasons. On the other side, there are many cases where you may want just to expose data using the classical CRUD. Furthermore, the nature of REST is schema-less that is an advantage from a versioning standpoint but it can be harder to browse for many clients. In this session, we will start discussing OData vs REST, then examine the v4 OASIS standard and dig into many samples and tools to rapidly start coding OData services.",
      "tags": [
        "OData",
        "REST",
        "Architecture",
        "Data",
        "CRUD"
      ],
      "author": {
        "firstname": "Raffaele",
        "lastname": "Rialdi",
        "twitter": "@raffaeler",
        "blog": "http://iamraf.net",
        "bio": "Raffaele Rialdi is a senior Software Architect working as a consultant, speaker and trainer. Since 2003, he is a Microsoft MVP in the Developer Security category. His passion for the community brought him to be member of the board of UGIdotNET, president of DotNetLiguria and co-founder of the Italian C++ user group. Currently he is working as architect and developer on the backend of an enterprise project and working on cross-platform mobile development in both C# and C++ languages.",
        "avatarUrl": "http://www.gravatar.com/avatar/2f72577141f4dfa8e985393773cb9e1f"
      }
    },
    {
      "title": "Asp.net 5 security 101",
      "description": "Asp.net 5 is not just a new release of the famous web framework but a real turning point which every developer should take care of. While cross-platform and open-source looks like just buzzwords, they are really impacting the architecture of web applications and security is certainly a fundamental part. In this session, after a brief overview of the Asp.net 5 architecture, we will see which options we have to protect our application and web apis.",
      "tags": [
        "Security",
        "AspNet5",
        "authentication",
        "authorization",
        "architecture"
      ],
      "author": {
        "firstname": "Raffaele",
        "lastname": "Rialdi",
        "twitter": "@raffaeler",
        "blog": "http://iamraf.net",
        "bio": "Raffaele Rialdi is a senior Software Architect working as a consultant, speaker and trainer. Since 2003, he is a Microsoft MVP in the Developer Security category. His passion for the community brought him to be member of the board of UGIdotNET, president of DotNetLiguria and co-founder of the Italian C++ user group. Currently he is working as architect and developer on the backend of an enterprise project and working on cross-platform mobile development in both C# and C++ languages.",
        "avatarUrl": "http://www.gravatar.com/avatar/2f72577141f4dfa8e985393773cb9e1f"
      }
    }
  ]
}
